{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 6, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 12, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 14, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 18, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 20, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 22, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 24, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 26, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 28, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 34, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 36, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 38, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 40, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 42, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 44, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 46, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_22", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "angbutter", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "angbutter", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "plain_bread", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "plain_bread", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "jam", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "jam", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "americano", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "americano", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "croissant", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "croissant", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "caffe_latte", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "caffe_latte", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "tiramisu_croissant", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "tiramisu_croissant", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cacao_deep", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cacao_deep", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "pain_au_chocolat", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pain_au_chocolat", "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "almond_croissant", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "almond_croissant", "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "croque_monsieur", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "croque_monsieur", "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "mad_garlic", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "mad_garlic", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "milk_tea", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "milk_tea", "inbound_nodes": [[["dense_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "gateau_chocolat", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "gateau_chocolat", "inbound_nodes": [[["dense_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "pandoro", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "pandoro", "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "cheese_cake", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "cheese_cake", "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lemon_ade", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lemon_ade", "inbound_nodes": [[["dense_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "orange_pound", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "orange_pound", "inbound_nodes": [[["dense_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "wiener", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "wiener", "inbound_nodes": [[["dense_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "vanila_latte", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "vanila_latte", "inbound_nodes": [[["dense_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "berry_ade", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "berry_ade", "inbound_nodes": [[["dense_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "tiramisu", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "tiramisu", "inbound_nodes": [[["dense_21", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "merinque_cookies", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "merinque_cookies", "inbound_nodes": [[["dense_22", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["angbutter", 0, 0], ["plain_bread", 0, 0], ["jam", 0, 0], ["americano", 0, 0], ["croissant", 0, 0], ["caffe_latte", 0, 0], ["tiramisu_croissant", 0, 0], ["cacao_deep", 0, 0], ["pain_au_chocolat", 0, 0], ["almond_croissant", 0, 0], ["croque_monsieur", 0, 0], ["mad_garlic", 0, 0], ["milk_tea", 0, 0], ["gateau_chocolat", 0, 0], ["pandoro", 0, 0], ["cheese_cake", 0, 0], ["lemon_ade", 0, 0], ["orange_pound", 0, 0], ["wiener", 0, 0], ["vanila_latte", 0, 0], ["berry_ade", 0, 0], ["tiramisu", 0, 0], ["merinque_cookies", 0, 0]]}}, "training_config": {"loss": {"angbutter": "mse", "plain_bread": "mse", "jam": "mse", "americano": "mse", "croissant": "mse", "caffe_latte": "mse", "tiramisu_croissant": "mse", "cacao_deep": "mse", "pain_au_chocolat": "mse", "almond_croissant": "mse", "croque_monsieur": "mse", "mad_garlic": "mse", "milk_tea": "mse", "gateau_chocolat": "mse", "pandoro": "mse", "cheese_cake": "mse", "lemon_ade": "mse", "orange_pound": "mse", "wiener": "mse", "vanila_latte": "mse", "berry_ade": "mse", "tiramisu": "mse", "merinque_cookies": "mse"}, "metrics": [[{"class_name": "RootMeanSquaredError", "config": {"name": "angbutter_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "plain_bread_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "jam_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "americano_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "croissant_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "caffe_latte_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "tiramisu_croissant_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "cacao_deep_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "pain_au_chocolat_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "almond_croissant_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "croque_monsieur_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "mad_garlic_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "milk_tea_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "gateau_chocolat_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "pandoro_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "cheese_cake_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "lemon_ade_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "orange_pound_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "wiener_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "vanila_latte_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "berry_ade_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "tiramisu_root_mean_squared_error", "dtype": "float32"}}], [{"class_name": "RootMeanSquaredError", "config": {"name": "merinque_cookies_root_mean_squared_error", "dtype": "float32"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.0010000000474974513, "decay": 0.0, "momentum": 0.0, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "almond_croissant/kernel", "shape": [20, 1], "dtype": "float32"}, {"name": "almond_croissant/bias", "shape": [1], "dtype": "float32"}, {"name": "americano/kernel", "shape": [8, 1], "dtype": "float32"}, {"name": "americano/bias", "shape": [1], "dtype": "float32"}, {"name": "angbutter/kernel", "shape": [2, 1], "dtype": "float32"}, {"name": "angbutter/bias", "shape": [1], "dtype": "float32"}, {"name": "berry_ade/kernel", "shape": [42, 1], "dtype": "float32"}, {"name": "berry_ade/bias", "shape": [1], "dtype": "float32"}, {"name": "cacao_deep/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "cacao_deep/bias", "shape": [1], "dtype": "float32"}, {"name": "caffe_latte/kernel", "shape": [12, 1], "dtype": "float32"}, {"name": "caffe_latte/bias", "shape": [1], "dtype": "float32"}, {"name": "cheese_cake/kernel", "shape": [32, 1], "dtype": "float32"}, {"name": "cheese_cake/bias", "shape": [1], "dtype": "float32"}, {"name": "croissant/kernel", "shape": [10, 1], "dtype": "float32"}, {"name": "croissant/bias", "shape": [1], "dtype": "float32"}, {"name": "croque_monsieur/kernel", "shape": [22, 1], "dtype": "float32"}, {"name": "croque_monsieur/bias", "shape": [1], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1, 2], "dtype": "float32"}, {"name": "dense/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1, 4], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [4], "dtype": "float32"}, {"name": "dense_10/kernel", "shape": [1, 22], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [22], "dtype": "float32"}, {"name": "dense_11/kernel", "shape": [1, 24], "dtype": "float32"}, {"name": "dense_11/bias", "shape": [24], "dtype": "float32"}, {"name": "dense_12/kernel", "shape": [1, 26], "dtype": "float32"}, {"name": "dense_12/bias", "shape": [26], "dtype": "float32"}, {"name": "dense_13/kernel", "shape": [1, 28], "dtype": "float32"}, {"name": "dense_13/bias", "shape": [28], "dtype": "float32"}, {"name": "dense_14/kernel", "shape": [1, 30], "dtype": "float32"}, {"name": "dense_14/bias", "shape": [30], "dtype": "float32"}, {"name": "dense_15/kernel", "shape": [1, 32], "dtype": "float32"}, {"name": "dense_15/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_16/kernel", "shape": [1, 34], "dtype": "float32"}, {"name": "dense_16/bias", "shape": [34], "dtype": "float32"}, {"name": "dense_17/kernel", "shape": [1, 36], "dtype": "float32"}, {"name": "dense_17/bias", "shape": [36], "dtype": "float32"}, {"name": "dense_18/kernel", "shape": [1, 38], "dtype": "float32"}, {"name": "dense_18/bias", "shape": [38], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [1, 40], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [40], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [1, 6], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [6], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [1, 42], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [42], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [1, 44], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [44], "dtype": "float32"}, {"name": "dense_22/kernel", "shape": [1, 46], "dtype": "float32"}, {"name": "dense_22/bias", "shape": [46], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [1, 8], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [1, 10], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [10], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [1, 12], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [12], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [1, 14], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [14], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [1, 16], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [1, 18], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [18], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [1, 20], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [20], "dtype": "float32"}, {"name": "gateau_chocolat/kernel", "shape": [28, 1], "dtype": "float32"}, {"name": "gateau_chocolat/bias", "shape": [1], "dtype": "float32"}, {"name": "jam/kernel", "shape": [6, 1], "dtype": "float32"}, {"name": "jam/bias", "shape": [1], "dtype": "float32"}, {"name": "lemon_ade/kernel", "shape": [34, 1], "dtype": "float32"}, {"name": "lemon_ade/bias", "shape": [1], "dtype": "float32"}, {"name": "mad_garlic/kernel", "shape": [24, 1], "dtype": "float32"}, {"name": "mad_garlic/bias", "shape": [1], "dtype": "float32"}, {"name": "merinque_cookies/kernel", "shape": [46, 1], "dtype": "float32"}, {"name": "merinque_cookies/bias", "shape": [1], "dtype": "float32"}, {"name": "milk_tea/kernel", "shape": [26, 1], "dtype": "float32"}, {"name": "milk_tea/bias", "shape": [1], "dtype": "float32"}, {"name": "orange_pound/kernel", "shape": [36, 1], "dtype": "float32"}, {"name": "orange_pound/bias", "shape": [1], "dtype": "float32"}, {"name": "pain_au_chocolat/kernel", "shape": [18, 1], "dtype": "float32"}, {"name": "pain_au_chocolat/bias", "shape": [1], "dtype": "float32"}, {"name": "pandoro/kernel", "shape": [30, 1], "dtype": "float32"}, {"name": "pandoro/bias", "shape": [1], "dtype": "float32"}, {"name": "plain_bread/kernel", "shape": [4, 1], "dtype": "float32"}, {"name": "plain_bread/bias", "shape": [1], "dtype": "float32"}, {"name": "tiramisu/kernel", "shape": [44, 1], "dtype": "float32"}, {"name": "tiramisu/bias", "shape": [1], "dtype": "float32"}, {"name": "tiramisu_croissant/kernel", "shape": [14, 1], "dtype": "float32"}, {"name": "tiramisu_croissant/bias", "shape": [1], "dtype": "float32"}, {"name": "vanila_latte/kernel", "shape": [40, 1], "dtype": "float32"}, {"name": "vanila_latte/bias", "shape": [1], "dtype": "float32"}, {"name": "wiener/kernel", "shape": [38, 1], "dtype": "float32"}, {"name": "wiener/bias", "shape": [1], "dtype": "float32"}]}]}